# ============================================================
#  Brewfile — Sparky Venture Labs dotfiles
#  Install everything: brew bundle --file=Brewfile
# ============================================================

# ── Taps ─────────────────────────────────────────────────────
tap "homebrew/bundle"

# ── Core CLI tools ───────────────────────────────────────────
brew "bash"           # Bash 5+ (macOS ships with 3.2)
brew "fswatch"        # File system watcher
brew "git"            # Git
brew "curl"           # HTTP client
brew "wget"           # File downloader
brew "jq"             # JSON processor
brew "mas"            # Mac App Store CLI
brew "gh"             # GitHub CLI
brew "tree"           # Directory tree viewer
brew "htop"           # Process monitor
brew "ncdu"           # Disk usage analyzer

# ── Development ──────────────────────────────────────────────
brew "node"           # Node.js
brew "python3"        # Python 3
brew "swiftlint"      # Swift linter

# ── Network ──────────────────────────────────────────────────
brew "nmap"           # Network scanner
brew "mtr"            # Network diagnostic

# ── Apps ─────────────────────────────────────────────────────
cask "visual-studio-code"    # Code editor
cask "iterm2"                # Terminal
cask "github"                # GitHub Desktop
cask "utm"                   # Virtual machines
